I guess the value of below expression. 
${vra7_deployment.my_vra7_deployment[0].resource_configuration[”LinuxRedHat6_VM.name”]} is not resolving to  desired value ("xstrlaab9893" ). I just tried expression output directly in node name as below 

resource "bigip_ltm_node" "node" {
  name    = "/Common/xstrlaab9893"
  address = "10.10.10.10"
}

root@terraforn-ubuntu3:~/go/src/github.com/terraform-providers/terraform-provider-bigip# terraform apply

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # bigip_ltm_node.node will be created
  + resource "bigip_ltm_node" "node" {
      + address          = "10.10.10.10"
      + connection_limit = (known after apply)
      + dynamic_ratio    = (known after apply)
      + id               = (known after apply)
      + monitor          = "/Common/icmp"
      + name             = "/Common/xstrlaab9893"
      + rate_limit       = (known after apply)
      + ratio            = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

bigip_ltm_node.node: Creating...
bigip_ltm_node.node: Creation complete after 0s [id=/Common/xstrlaab9893]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.

